{
    "1.0": "**(15.11.2025)**\nОгромное количество нововведений:\n**roulette**: Теперь поддерживает 2-4 игрока, добавлены новые предметы\n**Обновление логики команд**, которое позволит проще отлаживать их и добавлять новые фичи\n**Сайт с полным списком команд** и их тонкостями, доступный в меню help (WIP)\n**Добавлена локаль** gnida_lite, которая чуть более цензурна, нежели её оригинальная версия",
    "0.14.6.0": "**(04.12.2024)**\n- **♂CUM♂тентный карч**, привнёсшый следующие изменения:\n- Добавлена команда **roulette** - сыграйте в русскую рулетку со своим другом или против бота!\n- Внесены изменения в команду **help**, теперь необходимые разрешения прописаны более явно\n- Команда **roll** - Исправлена интерпретация нуля как falsy значения (код не выполнялся при использовании **cy/roll** 0 100)\n- Добавлена возможность кидать дайсы: 1d6, 4d4, 8d8\n- Полная перепись логики базы данных локалей пользователей\n- Добавлен английский язык в список локалей\n- Абсолютно все команды затронуты переключением локалей. Исключение составляют ивенты: автоматическое изменение роли, вызов ошибки при неправильном написании команды\n- Изменение команды **devs**\n\nОставайтесь на связи",
    "0.13.0.2.21680": "- Была добавлена категория Fun (4 новых команды)\n- Для большинства команд была добавлена слэш (/) версия\nОт себя хочется отметить, что в категории Fun появилась НЕВЕРОЯТНАЯ команда - dotersbrain\n\nВсё ёпта, такой вот патч вышел. Следующий ждите через год (~~Завтра~~)",
    "0.12.12.30.0": "**Библиотека**\nСовершён переезд на discord.py, позволяющий облегчить существование бота\n**someone**\nИсправлена ошибка, не позволяющяя писать более одного слова, в то время как остальные просто игнорировались\n**edit, say**\nБыли починены и улучшены, возвращён аргумент &c\n**Категория Fun**\nУдалена.\n**Locale**\nТеперь изменения локали применяются ко всем командам.\n\n***Slash-команды неактивны.***",
    "0.12.12.10.16367": "Изменение команд Embeds\n\nИзменено написание команд **say**, **edit** и переписана help под их изменение",
    "0.12.12.10.0": "Некоторое количество исправлений, возвращение команды vote через /\nИзменена логика команды mute - теперь нельзя установить время, на которое человек заглушается",
    "0.12.12.0.0": "Переход на новую библиотеку, способствующий дальнейшему поддержанию бота в живых. Изменения:\nУбрана команда vote из меню Slash-команд, так как новая либра не даёт мне способов ставить реакции под сообщением, что отправил бот\nНовая команда - timeout\nПозволяет `отправить подумать над своим поведением` пользователя.",
    "0.12.11.2.13771": "Deaf/Undeaf:\nЗаглушает участника в голосовом канале, когда в его ролях есть Deafened\nHelp:\nТеперь указывает список команд, применимый для способа вызова Help. Таким образом, Slash-help будет показывать команды только без конвертеров, а обычная Help все команды.\nТакже, многочисленные исправления",
    "0.12.10.2.12528": "Отдельные куски кода были рассортированы по разным файлам.",
    "0.12.10.2.11856": "Добавлена команда locale для изменения локали. Пока доступны только `ru` (по умолчанию) и `gnida`.\nSay/Edit\nУбран аргумент --everyone и запрещено упоминание @everyone каким-либо способом.",
    "0.12.10.1.11661": "Slash-Команды теперь применены ко всем командам, кроме тех, что используют конвертеры. Также, исправлены недоработки старых Slash-Команд и созданы новые (при написании некоторых команд будет ответ **Ошибка взаимодействия**, даже если команда была выполнена правильно).\n\n**Say**\n\nУбран аргумент `c&`, добавлен аргумент `f&` - текст в самом низу эмбеда.\n\n**Иное**\n\nТеперь команды пользователя не будут удаляться - это решение связано с рядом причин.",
    "0.12.9.11410": "Некоторые исправления и добавление скрытых фич.",
    "0.12.9.10988": "Добавлены Slash-Команды! Теперь вы можете просто написать `/`, чтобы вам вывелся список всех команд. Для их работы нужна новая [ссылка-приглашение](https://discord.com/api/oauth2/authorize?client_id=694170281270312991&permissions=8&scope=bot%20applications.commands). Slash-Команды применены ко всем командам за исключением тех, что находятся в категории Fun, Embeds и некоторые в Cephalon или имеют конвертеры (mute, remind, someone) ***Всё ещё БЕТА!***",
    "0.12.9.10519": "Небольшие исправления, в целом никак не связанные с работой бота."
}